 при первой отправки версии кода 
git init -> инициализирует гит репозитории, создает директорию .git превращает текущую директорию в git репозитории 
git add . -> отслеживает всех файлов, добавляет версии файла (снимки) в промежуточное пространство "индекс"
git add <name file> -> отслеживает конкретного файла  
git commit -m "message" -> создание комита (версии/слепка кода) с комментарием (сохранение версии кода в локальном git репозитории) 


git remote add origin <ssh/https> -> создание связи с удаленным репозитории на github 

git push origin <название ветки> (по умолчанию master, для mac main) -> отправка версии кода на удаленный репозитории 

при повторной отправки 
git add .
git commit -m "message"
git push origin master 








git status -> показывает статус/состояние файла 
git diff -> просмотр внесенных изменении 

git checkout hash_commit -> переход к указанному комииту 
git log -> просмотр версии кода / коммиты




git branch <название ветки> -> создание ветки 
git branch -> просмотр существующих веток
git checkout <название ветки> -> подключение или переход на указанную ветку
git switch  <название ветки> -> подключение или переход на указанную ветку

git pull origin master -> стягивание изменений с удаленного репозиторя с указанной ветки
git clone <url> -> склонировать/скачать удаленный репозитории 
